code/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "111"], ["text", "2121"], ["created_at", "2017-11-12 13:06:15.244162"], ["updated_at", "2017-11-12 13:06:15.244162"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "增加了一篇新的文章（修改文章）"], ["updated_at", "2017-11-12 13:08:59.941467"], ["id", 3]]